In [1]:
# It represent same information but in diffrent way
# The melt() method in Pandas is used to unpivot a DataFrame from wide format to long format.
# In other words, it takes columns that represent different variables and combines them into
# key-value pairs (i.e., long-form data).import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [3]:
df.melt(id_vars=["Name"], value_vars=["Math", "Science", 
"English"], var_name="Subject", value_name="Score")

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [ ]:
# pivot() â€” Long to Wide
# The pivot() function in Pandas is used to reshape data, specifically to turn long-format
# data into wide-format data
# This is the reverse operation of melt()